[
  {
    "id": "traffic-accident-analysis",
    "title": "Data-Driven California Traffic Accident Analysis",
    "description": "Conducted a comprehensive data analysis of traffic accidents in California using advanced data science techniques.",
    "fullDescription": "Conducted a comprehensive data analysis of traffic accidents in California using advanced data science techniques. This Kaggle project aimed to uncover patterns, identify key factors influencing accident frequency and severity, and propose data-backed recommendations for improving road safety.",
    "icon": "fas fa-car-crash",
    "technologies": ["Python", "Pandas", "Matplotlib", "Seaborn", "Folium"],
    "keyFindings": [
      "Identified peak hours and days for accident occurrence",
      "Mapped high-risk areas across California",
      "Analyzed the impact of weather conditions on accident severity",
      "Discovered correlations between road types and accident frequency"
    ],
    "impact": "The insights from this analysis can be used by traffic safety officials to implement targeted interventions, potentially reducing accident rates and improving overall road safety in California.",
    "link": "https://www.kaggle.com/code/aymanragab/california-traffic-accident-analysis",
    "xAxisLabel": "Month",
    "yAxisLabel": "Accidents",
    "visualizationData": [
      { "name": "Jan", "value": 115000 },
      { "name": "Feb", "value": 110000 },
      { "name": "Mar", "value": 85000 },
      { "name": "Apr", "value": 87000 },
      { "name": "May", "value": 78000 },
      { "name": "Jun", "value": 82000 },
      { "name": "Jul", "value": 65000 },
      { "name": "Aug", "value": 73000 },
      { "name": "Sep", "value": 95000 },
      { "name": "Oct", "value": 96000 },
      { "name": "Nov", "value": 110000 },
      { "name": "Dec", "value": 138000 }
    ]
  },
  {
    "id": "automated-essay-scoring",
    "title": "Automated Essay Scoring Project",
    "description": "This project automatically scores essays by analyzing content, grammar, and writing style using machine learning models.",
    "fullDescription": "This project automatically scores essays by analyzing content, grammar, and writing style using machine learning models. The score distribution shows a multimodal pattern with peaks at scores 2, 3, and 4. Longer essays tend to receive higher scores, as indicated by the essay length and score relationship. The most frequent words include 'Venus', 'cars', 'car', 'would', 'driverless', 'people', 'face', 'could', 'electoral', and 'like'. There is a positive but weak correlation between word count and score.",
    "icon": "fas fa-pen-nib",
    "technologies": ["Machine Learning", "Natural Language Processing (NLP)", "Data Preprocessing", "Model Evaluation", "Python for Data Analysis"],
    "keyFindings": [
      "Score distribution with peaks at 2, 3, and 4",
      "Positive relationship between essay length and score",
      "Most frequent words in essays based on TF-IDF scores",
      "Positive but weak correlation between word count and score"
    ],
    "impact": "This project provides a robust method for automating essay scoring, leveraging insights into content, grammar, and writing style to enhance evaluation efficiency and accuracy.",
    "link": "https://github.com/aymanrgab/automated-essay-scoring",
    "yAxisLabel": "tfidf_sum",
    "xAxisLabel": "word",
    "visualizationData": [
      { "name": "venus", "value": 1536 },
      { "name": "cars", "value": 1477 },
      { "name": "car", "value": 1416 },
      { "name": "would", "value": 1092 },
      { "name": "driverless", "value": 1036 },
      { "name": "people", "value": 1020 },
      { "name": "face", "value": 836 },
      { "name": "could", "value": 823 },
      { "name": "electoral", "value": 723 },
      { "name": "like", "value": 627 }
    ]
  },
  {
    "id": "titanic-classification",
    "title": "Titanic Classification Project",
    "description": "This project leverages machine learning techniques to predict the survival of passengers on the Titanic based on several key features.",
    "fullDescription": "This project leverages machine learning techniques to predict the survival of passengers on the Titanic based on several key features, including gender, passenger class, fare, age, and port of embarkation. Female passengers had a significantly higher survival rate than male passengers. Passengers in higher classes (1st and 2nd) had better chances of survival, as did those who paid higher fares. Younger passengers also tended to have a slightly higher survival rate, and those embarking at Cherbourg (C) had a higher survival rate compared to those embarking at Queenstown (Q) or Southampton (S).",
    "icon": "fas fa-ship",
    "technologies": ["Machine Learning", "Python for Data Analysis", "R Programming", "Data Visualization", "Data Analysis"],
    "keyFindings": [
      "Gender significantly affects survival rate",
      "Higher passenger class correlates with higher survival rate",
      "Higher fare correlates with higher survival rate",
      "Younger age correlates with slightly higher survival rate",
      "Cherbourg (C) port of embarkation correlates with higher survival rate"
    ],
    "impact": "This project provides predictive insights into passenger survival on the Titanic, contributing to historical analysis and understanding of the factors influencing survival rates.",
    "link": "https://github.com/aymanrgab/Titanic-Classification",
    "xAxisLabel": "Gender",
    "yAxisLabel": "Count",
    "visualizationData": [
      {"name": "0", "value": 0},
      { "name": "male_not_survived", "value": 468 },
      { "name": "male_survived", "value": 109 },
      { "name": "female_not_survived", "value": 81 },
      { "name": "female_survived", "value": 233 }
    ]
  },
  {
    "id": "credit-risk-prediction",
    "title": "Credit Risk Prediction Project",
    "description": "This project uses machine learning techniques to predict credit risk based on various loan and borrower characteristics.",
    "fullDescription": "This project employs advanced machine learning techniques to predict credit risk using a comprehensive dataset of loan information. The analysis includes preprocessing steps such as handling missing values, encoding categorical variables, and addressing class imbalance. Three models (Logistic Regression, Random Forest, and XGBoost) were implemented and evaluated, with XGBoost showing the best performance after hyperparameter tuning. The project also includes detailed exploratory data analysis, feature importance analysis, and partial dependence plots to provide insights into the factors influencing credit risk.",
    "icon": "fas fa-chart-line",
    "technologies": ["Machine Learning", "Python", "Pandas", "Scikit-learn", "XGBoost", "Data Visualization", "Feature Engineering"],
    "keyFindings": [
      "Loan intent influences default rates, which could be useful for risk assessment",
      "Most loans are for relatively small amounts, with larger loans being less common",
      "Loan grade, interest rate, and loan amount as a percentage of income are moderately correlated with loan status (default)",
      "The dataset has an imbalanced distribution of loan statuses, requiring techniques like SMOTE for effective modeling",
      "Age and credit history length are highly correlated, suggesting only one might be needed in a predictive model",
      "Loan grade and interest rate are strongly correlated, indicating potential redundancy in the model"
    ],
    "impact": "This project provides valuable insights for financial institutions to assess credit risk more accurately, potentially improving lending decisions and reducing default rates.",
    "link": "https://www.kaggle.com/code/aymanragab/credit-risk-prediction",
    "yAxisLabel": "Count",
    "xAxisLabel": "loan_amnt",
    "visualizationData": [
        {"name": "0", "value": 0},
        {"name": "1000", "value": 1000},
        {"name": "2000", "value": 1200},
        {"name": "3000", "value": 1500},
        {"name": "4000", "value": 1600},
        {"name": "5000", "value": 1800},
        {"name": "6000", "value": 1700},
        {"name": "7000", "value": 1400},
        {"name": "8000", "value": 1900},
        {"name": "9000", "value": 2300},
        {"name": "10000", "value": 2500},
        {"name": "11000", "value": 1600},
        {"name": "12000", "value": 1800},
        {"name": "13000", "value": 1300},
        {"name": "14000", "value": 1000},
        {"name": "15000", "value": 1500},
        {"name": "16000", "value": 1200},
        {"name": "17000", "value": 900},
        {"name": "18000", "value": 800},
        {"name": "19000", "value": 700},
        {"name": "20000", "value": 1500},
        {"name": "21000", "value": 600},
        {"name": "22000", "value": 500},
        {"name": "23000", "value": 400},
        {"name": "24000", "value": 300},
        {"name": "25000", "value": 1200},
        {"name": "26000", "value": 200},
        {"name": "27000", "value": 100},
        {"name": "28000", "value": 90},
        {"name": "29000", "value": 80},
        {"name": "30000", "value": 70},
        {"name": "31000", "value": 60},
        {"name": "32000", "value": 50},
        {"name": "33000", "value": 40},
        {"name": "34000", "value": 30},
        {"name": "35000", "value": 20}
    ]
  },
  {
    "id": "leaf-disease-detection",
    "title": "Leaf Disease Detection Project",
    "description": "Developed a Convolutional Neural Network (CNN) to accurately detect and classify diseases in plant leaves.",
    "fullDescription": "Developed a Convolutional Neural Network (CNN) to accurately detect and classify diseases in plant leaves using image data from the PlantVillage dataset. The solution includes a Flask-based web application for easy model interaction.",
    "icon": "fas fa-leaf",
    "technologies": ["Python", "TensorFlow", "Keras", "Flask", "OpenCV"],
    "keyFindings": [
      "Achieved 95% accuracy in disease classification",
      "Implemented data augmentation to improve model generalization",
      "Developed a user-friendly web interface for real-time disease detection",
      "Optimized model for deployment on resource-constrained devices"
    ],
    "impact": "This project has the potential to revolutionize plant disease management in agriculture, enabling early detection and targeted treatment of crop diseases, thus improving crop yields and food security.",
    "link": "https://github.com/aymanrgab/Leaf-Disease-Detection"
  },
  {
    "id": "bike-sharing-demand-prediction",
    "title": "Bike Sharing Demand Prediction Project",
    "description": "This project uses machine learning techniques to predict bike rental demand based on various temporal and environmental factors.",
    "fullDescription": "This project employs advanced machine learning techniques to predict bike sharing demand using a comprehensive dataset of rental information and environmental factors. The analysis includes preprocessing steps such as feature engineering, handling categorical variables, and scaling numerical features. Multiple models (Linear Regression, Ridge Regression, Lasso Regression, Random Forest, and Gradient Boosting) were implemented and evaluated, with Random Forest showing the best performance. The project also includes detailed exploratory data analysis, feature importance analysis, and partial dependence plots to provide insights into the factors influencing bike rental demand.",
    "icon": "fas fa-bicycle",
    "technologies": ["Machine Learning", "Python", "Pandas", "Scikit-learn", "Data Visualization", "Feature Engineering"],
    "keyFindings": [
      "Temporal factors are crucial: Time of day is the most important predictor, with rush hour periods showing peak demand",
      "Weather has a strong impact: Temperature positively correlates with rentals, while humidity has a negative effect",
      "Day type matters: Working days and weekends show distinct rental patterns",
      "Clear seasonal trends are observed in bike rental demand",
      "Long-term growth trend suggests increasing popularity of bike rentals over time",
      "The Random Forest model shows good alignment between predicted and actual rental counts, with room for improvement",
      "Bike rental demand distribution is right-skewed, with many low to moderate demand instances and fewer high demand instances",
      "Engineered features like rush_hour and cyclic time representations prove highly valuable for prediction"
    ],
    "impact": "This project provides valuable insights for bike-sharing companies to optimize their operations, potentially improving resource allocation and customer satisfaction by better predicting demand fluctuations.",
    "link": "https://www.kaggle.com/code/aymanragab/bikeshare-forecast-pro",
    "xAxisLabel": "Bike Rentals Count",
    "yAxisLabel": "Frequency",
    "visualizationData": [
      { "name": "0", "value": 2400 },
      { "name": "50", "value": 1100 },
      { "name": "100", "value": 700 },
      { "name": "150", "value": 600 },
      { "name": "200", "value": 500 },
      { "name": "250", "value": 400 },
      { "name": "300", "value": 300 },
      { "name": "350", "value": 250 },
      { "name": "400", "value": 200 },
      { "name": "500", "value": 100 },
      { "name": "600", "value": 50 },
      { "name": "700", "value": 25 },
      { "name": "800", "value": 10 },
      { "name": "900", "value": 5 }
    ]
  }
]

